app/controllers/books_controller.rb

SELECT "books".* FROM "books"
UPDATE "books" SET "complete_chapters" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["complete_chapters", 9], ["updated_at", "2021-02-24 15:53:36.008304"], ["id", 5]]
---
  def index
    @array = []
    @books = Book.all.order(id: :asc)
    @books.map do |book|
      @array.push({
        id: book.id,
        title: book.title,
        author: book.author,
        category: book.category,
        complete_chapters: book.complete_chapters,
        chapters: book.chapters,
        percentage: book.complete_chapters * 100 / book.chapters,
      })

INSERT INTO "books" ("title", "category", "chapters", "complete_chapters", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Another"], ["category", "Kids"], ["chapters", 20], ["complete_chapters", 0], ["created_at", "2021-02-24 21:08:23.956876"], ["updated_at", "2021-02-24 21:08:23.956876"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "books" SET "complete_chapters" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["complete_chapters", 10], ["updated_at", "2021-02-24 21:13:19.530177"], ["id", 8]]
---
  def update
    @book = Book.find(params[:id])
    @chapters_complete = @book.complete_chapters < @book.chapters ? @book.complete_chapters+1 : 0
    if @book.update(complete_chapters: @chapters_complete)